# import Libraries

In [41]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression
import seaborn as sns

# import dataset

In [42]:
df = pd.read_csv('train (1).csv')[['Age','Pclass','SibSp','Parch','Survived']]

In [43]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

# Drop NA Value

In [44]:
df.dropna(inplace=True)

In [45]:
df.sample(10)

      Age  Pclass  SibSp  Parch  Survived
714  52.0       2      0      0         0
461  34.0       3      0      0         0
442  25.0       3      1      0         0
471  38.0       3      0      0         0
862  48.0       1      0      0         1
847  35.0       3      0      0         0
202  34.0       3      0      0         0
310  24.0       1      0      0         1
357  38.0       2      0      0         0
268  58.0       1      0      1         1

# Seperate X & Y

In [46]:
X =df.iloc[:,0:4]
y = df.iloc[:,-1]

In [47]:
X.head()

    Age  Pclass  SibSp  Parch
0  22.0       3      1      0
1  38.0       1      1      0
2  26.0       3      0      0
3  35.0       1      1      0
4  35.0       3      0      0

 # Check  Accuracy For Logistic Regression

In [48]:
np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv=20))

0.6933333333333332

# Applying Feature  Construction

# Create New Column

In [49]:
X['Family_size'] = X['SibSp']  + X['Parch']  + 1

In [50]:
X.head()

    Age  Pclass  SibSp  Parch  Family_size
0  22.0       3      1      0            2
1  38.0       1      1      0            2
2  26.0       3      0      0            1
3  35.0       1      1      0            2
4  35.0       3      0      0            1

# Apply  New Function

In [51]:
def myfunc(num):
    if num == 1:
        return 0
    elif num > 1 and num <=4:
        return 1
    else:
        return 2

In [52]:
myfunc(4)

1

# Apply M Function

In [53]:
X['Family_type']  = X['Family_size'].apply(myfunc)

In [54]:
X.head()

    Age  Pclass  SibSp  Parch  Family_size  Family_type
0  22.0       3      1      0            2            1
1  38.0       1      1      0            2            1
2  26.0       3      0      0            1            0
3  35.0       1      1      0            2            1
4  35.0       3      0      0            1            0

#  Drop   unwanted  Columns

In [55]:
X.drop(columns=['SibSp','Parch','Family_size'],inplace=True)

In [56]:
X.head()

    Age  Pclass  Family_type
0  22.0       3            1
1  38.0       1            1
2  26.0       3            0
3  35.0       1            1
4  35.0       3            0

# Review Accuracy after Feature Construction

In [57]:
np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv=20))

0.7003174603174602

# Feature Spliting

# Review  Import Data set

In [58]:
 df = pd.read_csv('train (1).csv')

In [59]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Use  name  Column

In [60]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

# Separate  Salutation

In [61]:
df['Title'] = df['Name'].str.split(', ', expand=True)[1].str.split('.',expand=True)[0]

In [62]:
df['Title'] = df['Name'].str.split(', ', expand=True)[1].str.split('.',expand=True)[0]
df['Name'].str.split(', ', expand=True)[1].str.split('.',expand=True)[0]
df[['Title','Name']]

    Title                                               Name
0      Mr                            Braund, Mr. Owen Harris
1     Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2    Miss                             Heikkinen, Miss. Laina
3     Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4      Mr                           Allen, Mr. William Henry
..    ...                                                ...
886   Rev                              Montvila, Rev. Juozas
887  Miss                       Graham, Miss. Margaret Edith
888  Miss           Johnston, Miss. Catherine Helen "Carrie"
889    Mr                              Behr, Mr. Karl Howell
890    Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

# Review Accuracy after Feature Spliting

In [63]:
np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv=20))

0.7003174603174602